from django import forms
from .models import المريض, الاشتراك, الدفع

class تسجيل_الدخول(forms.Form):
    اسم = forms.CharField(max_length=255, label='اسم المستخدم')
    كلمة_المرور = forms.CharField(max_length=255, widget=forms.PasswordInput, label='كلمة المرور')

class إضافة_مريض(forms.ModelForm):
    class Meta:
        model = المريض
        fields = ('اسم', 'تاريخ_الميلاد', 'عنوان', 'رقم_الهاتف', 'البريد_الإلكتروني', 'كلمة_المرور')
        labels = {
            'اسم': 'اسم المريض',
            'تاريخ_الميلاد': 'تاريخ الميلاد',
            'عنوان': 'عنوان المريض',
            'رقم_الهاتف': 'رقم الهاتف',
            'البريد_الإلكتروني': 'البريد الإلكتروني',
            'كلمة_المرور': 'كلمة المرور'
        }
        widgets = {
            'كلمة_المرور': forms.PasswordInput
        }

class إضافة_اشتراك(forms.ModelForm):
    class Meta:
        model = الاشتراك
        fields = ('نوع_الاشتراك', 'تاريخ_البدء', 'تاريخ_الانتهاء', 'مبلغ_الاشتراك')
        labels = {
            'نوع_الاشتراك': 'نوع الاشتراك',
            'تاريخ_البدء': 'تاريخ البدء',
            'تاريخ_الانتهاء': 'تاريخ الانتهاء',
            'مبلغ_الاشتراك': 'مبلغ الاشتراك'
        }

class إضافة_دفع(forms.ModelForm):
    class Meta:
        model = الدفع
        fields = ('تاريخ_الدفع', 'مبلغ_الدفع', 'طريقة_الدفع', 'حالة_الدفع')
        labels = {
            'تاريخ_الدفع': 'تاريخ الدفع',
            'مبلغ_الدفع': 'مبلغ الدفع',
            'طريقة_الدفع': 'طريقة الدفع',
            'حالة_الدفع': 'حالة الدفع'
        }
